[
    {
        "name": "",
        "N_min": 0,
        "N_max": 0,
        "P_min": 0,
        "P_max": 0,
        "K_min": 0,
        "K_max": 0,
        "moist_min": 0,
        "moist_max": 0,
        "ph_min": 0,
        "ph_max": 0,
        "temp_min": 0,
        "temp_max": 0
    },
    {
        "name": "cauliflower",
        "N_min": 80,
        "N_max": 150,
        "P_min": 15,
        "P_max": 40,
        "K_min": 50,
        "K_max": 100,
        "ph_min": 6.0,
        "ph_max": 7.0,
        "temp_min": 5.0,
        "temp_max": 22.0,
        "moist_min": 60.0,
        "moist_max": 80.0,
        "analysis": "Cauliflower thrives in well-drained, loamy soil with a pH between 6.0 and 7.0. It requires adequate nitrogen for head development, phosphorus for root growth, and potassium for overall plant health and disease resistance.  Optimal temperatures range from 5°C to 22°C. Consistent moisture is crucial, particularly during head formation.  Avoid soils that are too sandy or clayey, as they can impede root growth and water penetration. Amend soil with organic matter like compost to improve fertility and drainage.  Early planting is crucial to avoid frost damage. Consider foliar feeding with calcium to prevent tip burn.",
        "favorite": false
    },
    {
        "name": "wheat",
        "N_min": 100,
        "N_max": 250,
        "P_min": 15,
        "P_max": 50,
        "K_min": 50,
        "K_max": 150,
        "ph_min": 6.0,
        "ph_max": 7.5,
        "temp_min": 4.0,
        "temp_max": 30.0,
        "moist_min": 50.0,
        "moist_max": 80.0,
        "analysis": "Wheat thrives in well-drained loamy soils with a pH between 6.0 and 7.5. Optimal temperature ranges from 4°C to 30°C during the growing season. Adequate moisture is crucial, with ideal soil moisture levels between 50% and 80% of the field capacity. Regular fertilization with nitrogen, phosphorus, and potassium is essential for healthy growth and high yields.  Consider timing fertilization based on soil test results and crop needs.  Adequate drainage prevents root rot.  Wheat is sensitive to frost damage, so early planting and protection from late frosts are important. Ensure appropriate irrigation during dry periods. Variety selection is critical, considering local climate and disease resistance. Consider crop rotation to improve soil health and reduce pest/disease pressure.",
        "favorite": true
    },
    {
        "name": "cherry",
        "N_min": 80,
        "N_max": 160,
        "P_min": 15,
        "P_max": 40,
        "K_min": 40,
        "K_max": 80,
        "ph_min": 6.0,
        "ph_max": 7.0,
        "temp_min": 25.0,
        "temp_max": 30.0,
        "moist_min": 60.0,
        "moist_max": 90.0,
        "analysis": "Cherries thrive in well-drained, loamy or sandy loam soils with a pH between 6.0 and 7.0.  Adequate organic matter is essential for good drainage and nutrient retention.  They require a long growing season with minimum frost-free days.  Moderate rainfall is ideal, but drought tolerance is beneficial.  Consistent moisture is critical, especially during fruit development.  Avoid soils with excessive clay content which can lead to waterlogging. Pruning is crucial for fruit production and tree health.  Consider disease-resistant varieties."
    },
    {
        "name": "sugarcane",
        "N_min": 120,
        "N_max": 250,
        "P_min": 30,
        "P_max": 80,
        "K_min": 150,
        "K_max": 300,
        "ph_min": 6.0,
        "ph_max": 7.5,
        "temp_min": 18.0,
        "temp_max": 35.0,
        "moist_min": 60.0,
        "moist_max": 90.0,
        "analysis": "Sugarcane thrives in well-drained, fertile soils with a pH between 6.0 and 7.5. It requires a significant amount of nitrogen (120-250 kg/ha), phosphorus (30-80 kg/ha), and potassium (150-300 kg/ha).  Optimal temperatures range from 18°C to 35°C, and it requires high soil moisture, ideally maintaining 60-90% field capacity.  Sugarcane is sensitive to waterlogging, so good drainage is crucial.  Regular fertilization, particularly nitrogen, is essential for maximizing yield.  Irrigation may be necessary in drier periods, especially in regions with unpredictable rainfall.  Proper pest and disease management is also critical for healthy sugarcane growth.",
        "favorite": true
    },
    {
        "name": "apple",
        "N_min": 80,
        "N_max": 120,
        "P_min": 20,
        "P_max": 30,
        "K_min": 60,
        "K_max": 80,
        "ph_min": 6.0,
        "ph_max": 7.0,
        "temp_min": 15.0,
        "temp_max": 25.0,
        "moist_min": 20.0,
        "moist_max": 35.0,
        "analysis": "Apple trees thrive in well‑drained loamy soils with a pH of 6.0–7.0. Adequate nitrogen (80–120 kg /ha) supports vigorous vegetative growth, while moderate phosphorus (20–30 kg /ha) and potassium (60–80 kg /ha) levels promote root development and fruit quality. Maintain soil moisture at 20–35 % of field capacity to avoid waterlogging, which can cause root rot. The optimal growing‑season temperature range is 15–25 °C; however, apples require a period of cold dormancy (0–7 °C) to break bud dormancy and ensure proper fruit set. Regular monitoring of soil pH, nutrient status, and moisture, combined with proper pruning, irrigation, and pest management, will help achieve high yields and quality fruit.",
        "favorite": false
    },
    {
        "name": "tomato",
        "N_min": 80,
        "N_max": 240,
        "P_min": 15,
        "P_max": 60,
        "K_min": 100,
        "K_max": 300,
        "ph_min": 5.5,
        "ph_max": 6.5,
        "temp_min": 10.0,
        "temp_max": 30.0,
        "moist_min": 60.0,
        "moist_max": 80.0,
        "analysis": "Tomatoes thrive in well-drained, loamy or sandy loam soils rich in organic matter. A pH between 5.5 and 6.5 is optimal. They require consistent moisture, especially during fruit development. Temperatures between 18-30°C are ideal.  Avoid prolonged periods of drought and excessive humidity.  Full sun (6-8 hours daily) is essential for good fruit production. Mulching helps retain moisture and suppress weeds.  Consider disease-resistant varieties."
    }
]